[
    {
        "Название": "Трансформеры",
        "Рейтинг": 7.595,
        "Год выхода": 2007,
        "Описание": "В течение многих столетий две расы роботов-инопланетян — Автоботы и Десептиконы — вели войну, ставкой в которой была судьба Вселенной. И вот война докатилась до Земли. В то время, когда силы зла ищут ключ к верховной власти, наш последний шанс на спасение находится в руках юного землянина. Единственное, что стоит между несущими зло Десептиконами и высшей властью - это ключ, находящийся в руках простого парнишки.\nОбычный подросток, Сэм Уитвикки озабочен повседневными хлопотами — школа, друзья, машины, девочки. Не ведая о том, что он является последним шансом человечества на спасение, Сэм вместе со своей подругой Микаэлой оказывается вовлеченным в противостояние Автоботов и Десептиконов. Только тогда Сэм понимает истинное значение семейного девиза Уитвикки — «без жертв нет победы!»"
    },
    {
        "Название": "Трансформеры",
        "Рейтинг": 7.541,
        "Год выхода": 1986,
        "Описание": "Автоботы и Десептиконы продолжают войну за контроль над территорией в 2005 году. Войска Мегатрона завоевали Кибертрон, но Автоботы готовы это изменить. В масштабном конфликте старые герои падут и новые восстанут, в то время как планета - демон Юникрон будет приближаться к их родному миру."
    },
    {
        "Название": "Трансформеры",
        "Рейтинг": 7.582,
        "Год выхода": 1984,
        "Описание": "Сюжет мультсериала повествует о войне за территорию двух фракций живых роботов с планеты Кибертрон - Автоботов и Десептиконов. В ходе войны природные ресурсы их родной планеты Кибертрон исчерпываются. Чтобы выжить представителям обеих рас приходится бороздить космос в поисках новых ресурсов. Попав на планету Земля войска Оптимуса Прайма и Мегатрона продолжают свою борьбу в 1984 году, скрываясь от людей под камуфляжем доминирующей земной формы - машинной технике. Однако вскоре их война перестаёт быть тайной."
    },
    {
        "Название": "Трансформеры",
        "Рейтинг": 5.557,
        "Год выхода": 2007,
        "Описание": "Злобные Десептиконы появились в Детройте. С помощью Великой Искры Мегатрон может обратить всех роботов Земли в Десептиконов. Но на Землю также прибывают и Оптимус Прайм с Автоботами, они планируют остановить Мегатрона и помешать его коварным планам."
    },
    {
        "Название": "Трансформеры",
        "Рейтинг": 5.737,
        "Год выхода": 2001,
        "Описание": "Мегатрон с отрядом преданных ему Десептиконов прибыл на Землю с одной лишь целью: Уничтожить все живое! Но героические Автоботы, ведомые Оптимусом Праймом уже давно были готовы к нападению. Приняв формы земных машин, они многие года скрывались от взора людей, и теперь встают на зашиту планеты от агрессоров."
    },
    {
        "Название": "Трансформеры",
        "Рейтинг": 0,
        "Год выхода": 2006,
        "Описание": ""
    },
    {
        "Название": "Трансформеры: Месть падших",
        "Рейтинг": 7.138,
        "Год выхода": 2009,
        "Описание": "Прошло два года с тех пор, как юный Сэм Уитвикки спас Вселенную, предотвратив глобальную битву между враждующими воинственными расами инопланетных роботов. Несмотря на свои героические подвиги, Сэм остается обычным подростком с обычными проблемами — поступлением в колледж и родителями. Разумеется, отъезд будет тяжело воспринят лучшим другом, роботом — телохранителем Бамблби.\n\nСэм изо всех сил пытается забыть о конфликте в Мишн Сити и вернуться к нормальной жизни. Однако битва между Автоботами и Десептиконами, несмотря на гриф полной секретности, многое изменила..."
    },
    {
        "Название": "Трансформеры 3: Тёмная сторона Луны",
        "Рейтинг": 6.848,
        "Год выхода": 2011,
        "Описание": "Американское правительство долго скрывало тайну первой высадки человека на Луну. Оказывается, 20 июля 1969 года совершив посадку на Луне, американские астронавты обнаружили разбившийся корабль автоботов и останки роботов. Программу засекретили, но спустя сорок лет она вновь всплыла, как камень преткновения в отношениях людей и автоботов. Сем Уитвики и его новая подружка Карли оказываются в самом эпицентре новой глобальной заварушки с участием десептиконов и автоботов, в основу которого положена тайна, которую хранит темная сторона Луны."
    },
    {
        "Название": "Трансформеры: Эпоха истребления",
        "Рейтинг": 6.104,
        "Год выхода": 2014,
        "Описание": "Автоботы и десептиконы оставили человечество собирать планету по кусочкам. Между тем группа могущественных бизнесменов и гениальных ученых пытается извлечь уроки из ошибок прошлого и улучшить технологии до такой степени, чтобы выйти за пределы контролируемого ранее. В это время другая группа — древних мощных трансформеров — берет Землю под прицел."
    },
    {
        "Название": "Трансформеры: Последний рыцарь",
        "Рейтинг": 5.734,
        "Год выхода": 2017,
        "Описание": "Оптимус Прайм исчез. Люди ведут войну с Трансформерами. Ключ к нашему будущему погребен в тайнах прошлого, в скрытой истории Трансформеров на Земле… Миссия по спасению мира ложится на плечи разношерстной компании, состоящей из Кейда Йегера, Бамблби, английского лорда и профессора из Оксфорда. Пришла пора действовать! Жертвы станут героями. Герои станут злодеями. Выстоит только один мир: их или наш."
    }
]